* Desemberbrukere
Denne spørringen kategoriserer brukere inn i grupper avhengig av om de har besøkt NRK i november, desember og januar.

#+begin_src bigquery
CREATE OR REPLACE TABLE `nrk-scratchbook.Emil.TLGtall` AS (
WITH
  ALL_DATES_AND_USERS AS (
    SELECT partitionDate, nrkUserId
      FROM UNNEST(GENERATE_DATE_ARRAY('2024-11-27', '2025-01-22', INTERVAL 28 day)) partitionDate
           CROSS JOIN (SELECT nrkUserId FROM `nrk-datahub.prod.registered_users_v01`)
  ),

  SOURCE_ALL AS (
    SELECT partitionDate dato, nrkUserId, userOrProfile, loyaltyGroup,
           IF(userOrProfile != 'user',
             CASE
               WHEN EXTRACT(YEAR FROM partitionDate) - birthYear IS NULL THEN NULL
               WHEN EXTRACT(YEAR FROM partitionDate) - birthYear < 13 THEN CAST(EXTRACT(YEAR FROM partitionDate) - birthYear AS STRING)
               ELSE '13'
             END,
             CASE
               WHEN EXTRACT(YEAR FROM partitionDate) - birthYear IS NULL THEN NULL
               WHEN EXTRACT(YEAR FROM partitionDate) - birthYear < 0 THEN '-1'
               WHEN EXTRACT(YEAR FROM partitionDate) - birthYear < 13 THEN '0-12'
               WHEN EXTRACT(YEAR FROM partitionDate) - birthYear < 20 THEN '13-19'
               WHEN EXTRACT(YEAR FROM partitionDate) - birthYear < 30 THEN '20-29'
               WHEN EXTRACT(YEAR FROM partitionDate) - birthYear < 50 THEN '30-49'
               WHEN EXTRACT(YEAR FROM partitionDate) - birthYear < 70 THEN '50-69'
               ELSE '70+'
             END) aldersgruppe,
           DATE(registered) >= partitionDate - 28 AND DATE(registered) < partitionDate ny_bruker,
           CASE
             WHEN last28Days.daysVisited = 0 THEN 0
             WHEN last28Days.daysVisited < 4 THEN 3
             WHEN last28Days.daysVisited < 7 THEN 6
             WHEN last28Days.daysVisited < 11 THEN 10
             WHEN last28Days.daysVisited < 16 THEN 15
             WHEN last28Days.daysVisited < 22 THEN 21
             WHEN last28Days.daysVisited < 29 THEN 28
           END aktive_dager,
      FROM ALL_DATES_AND_USERS
           LEFT JOIN `nrk-datahub.prod.registered_users_v01` USING(nrkUserId)
           LEFT JOIN `nrk-datahub.snowplow_aggregate.total_rfv` USING(partitionDate, nrkUserId)
     WHERE partitionDate IN ('2024-11-27', '2024-12-25', '2025-01-22')
     ORDER BY nrkUserId, dato
  ),

  FORRIGE_PERIODE28 AS (
    SELECT nov.*,
           des.loyaltyGroup lojalitet_des, des.ny_bruker `Ny i desember`, des.aktive_dager `Aktive dager i des`,
           jan.loyaltyGroup lojalitet_jan, jan.ny_bruker `Ny i januar`, jan.aktive_dager `Aktive dager i jan`
      FROM (SELECT * FROM SOURCE_ALL WHERE dato = '2024-11-27') nov
           LEFT JOIN (SELECT * FROM SOURCE_ALL WHERE dato = '2024-12-25') des USING(nrkUserId)
           LEFT JOIN (SELECT * FROM SOURCE_ALL WHERE dato = '2025-01-22') jan USING(nrkUserId)
  ),

  AGG AS (
    SELECT dato, userOrProfile, aldersgruppe, 
           loyaltyGroup lojalitet_nov,
           lojalitet_des,
           lojalitet_jan, 
           IFNULL(aktive_dager, 0) `Aktive dager i nov`, 
           IFNULL(`Aktive dager i des`, 0) `Aktive dager i des`,
           IFNULL(`Aktive dager i jan`, 0) `Aktive dager i jan`,
           CASE
             WHEN `Ny i desember` THEN 'Nye brukere'
             WHEN IFNULL(aktive_dager, 0) > 0 AND IFNULL(`Aktive dager i des`, 0) > 0 THEN 'tilbakevendende'
             WHEN IFNULL(aktive_dager, 0) > 0 AND NOT IFNULL(`Aktive dager i des`, 0) > 0 THEN 'mistede'
             WHEN NOT IFNULL(aktive_dager, 0) > 0 AND IFNULL(`Aktive dager i des`, 0) > 0 THEN 'reaktiverte'
           END `Brukstype des`,
           CASE
             WHEN `Ny i januar` THEN 'Nye brukere'
             WHEN IFNULL(`Aktive dager i des`, 0) > 0 AND IFNULL(`Aktive dager i jan`, 0) > 0 THEN 'tilbakevendende'
             WHEN IFNULL(`Aktive dager i des`, 0) > 0 AND NOT IFNULL(`Aktive dager i jan`, 0) > 0 THEN 'mistede'
             WHEN NOT IFNULL(`Aktive dager i des`, 0) > 0 AND IFNULL(`Aktive dager i jan`, 0) > 0 THEN 'reaktiverte'
           END `Brukstype jan`,
           COUNT(nrkUserId) brukere
      FROM FORRIGE_PERIODE28
     GROUP BY ALL)

  SELECT *
    FROM AGG)
#+end_src

Vi begynner med å se på hvor stor andel av brukerne som bare har besøkt NRK i desember.
#+begin_src bigquery
  #standardSQL
   SELECT userOrProfile, --lojalitet_des, 
        SUM(IF((`Brukstype des` = 'reaktiverte' OR `Brukstype des` = 'Nye brukere') AND (`Brukstype jan` = 'mistede' OR `Brukstype jan` IS NULL), brukere, 0)) `Kommer i des og drar i jan`,
        SUM(IF(`Brukstype des` IS NOT NULL OR `Brukstype des` != 'mistede', brukere, 0)) `Tot brukere i desember`,
        ROUND(SUM(IF((`Brukstype des` = 'reaktiverte' OR `Brukstype des` = 'Nye brukere') AND (`Brukstype jan` = 'mistede' OR `Brukstype jan` IS NULL), brukere, 0)) / SUM(IF(`Brukstype des` IS NOT NULL OR `Brukstype des` != 'mistede', brukere, 0)), 3) andel
   FROM `nrk-scratchbook.Emil.TLGtall`
  --WHERE (`Brukstype jan` = 'mistede' OR `Brukstype jan` IS NULL)
  GROUP BY ALL
  ORDER BY 1, 2
#+end_src

#+RESULTS:
| userOrProfile | Kommer i des og drar i jan | Tot brukere i desember | andel |
|---------------+----------------------------+------------------------+-------|
| profile       |                      29042 |                 310036 | 0.094 |
| user          |                      71894 |                1970740 | 0.036 |

Det er bare 9,4 % av barneprofilene og 3,6 % av voksenprofilene som kommer til NRK i desember og forlater oss i januar. Hvordan ser dette ut per lojalitetsgruppe?

#+begin_src bigquery
  #standardSQL
   SELECT userOrProfile, lojalitet_des, 
        SUM(IF((`Brukstype des` = 'reaktiverte' OR `Brukstype des` = 'Nye brukere') AND (`Brukstype jan` = 'mistede' OR `Brukstype jan` IS NULL), brukere, 0)) `Kommer i des og drar i jan`,
        SUM(IF(`Brukstype des` IS NOT NULL OR `Brukstype des` != 'mistede', brukere, 0)) `Tot brukere i desember`,
        ROUND(SUM(IF((`Brukstype des` = 'reaktiverte' OR `Brukstype des` = 'Nye brukere') AND (`Brukstype jan` = 'mistede' OR `Brukstype jan` IS NULL), brukere, 0)) / SUM(IF(`Brukstype des` IS NOT NULL OR `Brukstype des` != 'mistede', brukere, 0)), 3) andel
   FROM `nrk-scratchbook.Emil.TLGtall`
  --WHERE (`Brukstype jan` = 'mistede' OR `Brukstype jan` IS NULL)
  GROUP BY ALL
  ORDER BY 1, 2
#+end_src

#+RESULTS:
| userOrProfile | lojalitet_des   | Kommer i des og drar i jan | Tot brukere i desember | andel |
|---------------+-----------------+----------------------------+------------------------+-------|
| profile       |                 |                       1237 |                   1771 | 0.698 |
| profile       | Fan             |                         28 |                  64762 |   0.0 |
| profile       | Fast Følge      |                        464 |                  46602 |  0.01 |
| profile       | Langdistanse    |                       1809 |                  54719 | 0.033 |
| profile       | One-Night-Stand |                       5966 |                  56099 | 0.106 |
| profile       | Slår opp        |                      19538 |                  86083 | 0.227 |
| user          |                 |                       1836 |                   2143 | 0.857 |
| user          | Fan             |                         57 |                 733191 |   0.0 |
| user          | Fast Følge      |                        796 |                 289373 | 0.003 |
| user          | Langdistanse    |                       3186 |                 289490 | 0.011 |
| user          | One-Night-Stand |                      11669 |                 256429 | 0.046 |
| user          | Slår opp        |                      54350 |                 400114 | 0.136 |
